ufr2-02/constant/polyMesh/blockMeshDict
FoamFile
{
    version	 2.0;
    format	 ascii;
    class	 dictionary;
    object	 blockMeshDict;
}

/*
Automatically generated with ./generateMeshDict.pl 0.04 0.392 0.4 1.36 0.56 0.002
*/

convertToMeters	 1.0;

vertices
(
    ( -0.4  0.28 0 )
    ( -0.02   0.28 0 )
    (  0.02   0.28 0 )
    (  0.96  0.28 0 )
    ( -0.4  0.02 0 )
    ( -0.02   0.02 0 )
    (  0.02   0.02 0 )
    (  0.96  0.02 0 )
    ( -0.4  -0.02 0 )
    ( -0.02   -0.02 0 )
    (  0.02   -0.02 0 )
    (  0.96  -0.02 0 )
    ( -0.4  -0.28 0 )
    ( -0.02   -0.28 0 )
    (  0.02   -0.28 0 )
    (  0.96  -0.28 0 )
    ( -0.4  0.28 0.392 )
    ( -0.02   0.28 0.392 )
    (  0.02   0.28 0.392 )
    (  0.96  0.28 0.392 )
    ( -0.4  0.02 0.392 )
    ( -0.02   0.02 0.392 )
    (  0.02   0.02 0.392 )
    (  0.96  0.02 0.392 )
    ( -0.4  -0.02 0.392 )
    ( -0.02   -0.02 0.392 )
    (  0.02   -0.02 0.392 )
    (  0.96  -0.02 0.392 )
    ( -0.4  -0.28 0.392 )
    ( -0.02   -0.28 0.392 )
    (  0.02   -0.28 0.392 )
    (  0.96  -0.28 0.392 )
);

blocks
(
    hex (4 5 1 0 20 21 17 16) (29 19 59) simpleGrading (0.05 20 1)
    hex (5 6 2 1 21 22 18 17) (21 19 59) simpleGrading (1 20 1)
    hex (6 7 3 2 22 23 19 18) (73 19 59) simpleGrading (20 20 1)
    hex (8 9 5 4 24 25 21 20) (29 21 59) simpleGrading (0.05 1 1)
    hex (10 11 7 6 26 27 23 22) (73 21 59) simpleGrading (20 1 1)
    hex (12 13 9 8 28 29 25 24) (29 19 59) simpleGrading (0.05 0.05 1)
    hex (13 14 10 9 29 30 26 25) (21 19 59) simpleGrading (1 0.05 1)
    hex (14 15 11 10 30 31 27 26) (73 19 59) simpleGrading (20 0.05 1)
);

edges
(
/*
    arc 5 6 ( 0 0.02 0 )
    arc 6 10 ( 0.02 0 0 )
    arc 9 10 ( 0 -0.02 0 )
    arc 9 5 ( -0.02 0 0 )
    arc 21 22 ( 0 0.02 0.392 )
    arc 26 22 ( 0.02 0 0.392 )
    arc 25 26 ( 0 -0.02 0.392 )
    arc 25 21 ( -0.02 0 0.392 )
*/
);

patches
(
    wall walls
    (
        (5 21 22 6)
        (6 22 26 10)
        (10 26 25 9)
        (9 25 21 5)
    )

    patch inlet
    (
        (4 20 16 0)
        (8 24 20 4)
        (12 28 24 8)
    )
    patch outlet
    (
        (3 19 23 7)
        (7 23 27 11)
        (11 27 31 15)
    )
    wall sides
    (
        (16 17 1 0)
        (17 18 2 1)
        (18 19 3 2)
        (12 13 29 28)
        (13 14 30 29)
        (14 15 31 30)
    )
    wall lowerUpper
    (
        (0 1 5 4)
        (1 2 6 5)
        (2 3 7 6)
        (4 5 9 8)
        (6 7 11 10)
        (8 9 13 12)
        (9 10 14 13)
        (10 11 15 14)
        (20 21 17 16)
        (21 22 18 17)
        (22 23 19 18)
        (24 25 21 20)
        (26 27 23 22)
        (28 29 25 24)
        (29 30 26 25)
        (30 31 27 26)
    )
);

mergPatchPairs
(
);
